      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics:
      ******************************************************************
       IDENTIFICATION DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       PROGRAM-ID. BRM-PROGRAM.
       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       INPUT-OUTPUT SECTION.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
      **
      * The main procedure of the program
      **
            DISPLAY "Hello world"

      ** add other procedures here
       END PROGRAM BRM-PROGRAM.
