     A                                      UNIQUE                              
     A                                      REF(REFMZP)                         
                R CENIKPF0                                                      
     A            MATER     R                                                   
     A            CENA      R                                                   
     A            NAZEV     R                                                   
                K MATER                                                         
