     A                                      REF(REFMZP)                         
                R OBRATPF0                                                      
     A            ZAVOD     R                                                   
     A            SKLAD     R                                                   
     A            MATER     R                                                   
     A            MNOBR     R                                                   
     A          K ZAVOD                                                         
     A          K SKLAD                                                         
     A          K MATER                                                         
