PGM  /* Begin program */                                                        
                                                                                
? DSPfd FILE(CENY) ??output(*)                                                  
                                                                                
ENDPGM /* End program */                                                        
